# Joule Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Joule Property
SymbolTypeId Class See Also
---
Symbol J, indicating unit Joules.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Joule { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Joule As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Joule {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace